package module1.lesson2.step14;

/**
 * Created by YKuzmich on 04.12.2015.
 *Напишите программу, выводящую в консоль It's alive! It's alive!

 Класс должен называться "Main", это ограничение проверяющей системы.
 */
public class Main
{
    public static void main(String[] args)
    {
        System.out.print("It's alive! It's alive!");
    }
}
